app/views/users/_profile.html.erb

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 2]]
---
		<th>followers</th>
		<th><%= link_to user.passive_relationships.count, followers_user_path(user) %></th>