app/views/users/followers.html.erb

<!-- aさんをフォローしてる人を数える　0だった場合 -->
			<% if @user.passive_relationships.count == 0 %>
---
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 1]]

								<!-- フォロワー数 -->
								<td>フォロワー数: <%= user.passive_relationships.count %></td>
---
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 3]]