app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("following_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["following_id", 1], ["follower_id", 2], ["created_at", "2020-07-23 00:57:30.882024"], ["updated_at", "2020-07-23 00:57:30.882024"]]
---
	def create
  		follow = current_user.active_relationships.build(follower_id: params[:user_id])
		# 条件
		if follow.save

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 26]]
---
	def destroy
  		# ここ記述まだ明確に和kってない
  		follow = current_user.active_relationships.find_by(follower_id: params[:user_id])
		# 条件relationships テーブルに上記で指定したカラムと値が存在している場合はdesrtoy しない場合は何もせずに元のページへ
		follow.destroy